Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_pwm.h
/*
 * pic18f_q84_pwm.h
 *
 * PWM (16-bit Pulse-Width Modulator with Compare) register definitions
 * for PIC18F27/47/57Q84 microcontrollers.
 *
 * The device provides four independent PWM modules (PWM1-PWM4), each
 * containing:
 *
 *   - An integrated 16-bit timer/counter with 8-bit prescaler
 *   - A 16-bit period register (PR) defining the PWM cycle length
 *   - One output slice (Slice 1) with two independent 16-bit compare
 *     parameters (P1 and P2), each driving a separate output pin
 *   - Double-buffered period and duty-cycle registers; new values are
 *     transferred to the active registers on a software-selected load
 *     trigger event (auto-load source)
 *   - Multiple output alignment modes:
 *       Left-aligned   : standard edge-aligned PWM
 *       Right-aligned  : output transitions aligned to period end
 *       Center-aligned : symmetric PWM (up/down counting)
 *       Variable align : programmable left/right alignment
 *       Dual edge      : independent rising and falling edge control
 *   - Configurable external reset source for the period counter
 *   - Push-pull mode for alternating outputs on successive periods
 *   - Period interrupt with programmable postscaler offset
 *
 * Two global registers (PWMLOAD and PWMEN) provide simultaneous
 * control of the load-armed and enable states across all four modules,
 * allowing synchronised multi-channel PWM operation.
 *
 * Register base addresses:
 *   PWM1: 0x0460    PWM2: 0x046F    PWM3: 0x047E    PWM4: 0x048D
 *
 * Reference: Microchip DS40002213D
 *            PIC18F27/47/57Q84 Data Sheet
 *
 * Requires SFR8(addr) and SFR16(addr) macros defined externally.
 */

#ifndef PIC18F_Q84_PWM_H
#define PIC18F_Q84_PWM_H

/* =====================================================================
 *  PWM1 - 16-bit PWM Module 1
 *  Base address: 0x0460
 * ================================================================== */

/* -------------------------------------------------------------------
 * PWM1ERS - PWM1 External Reset Source Select
 * Address: 0x0460
 *
 * Selects the signal source that resets the PWM1 period counter.
 * When the selected event occurs and the external reset is active
 * (respecting ERSPOL), the 16-bit period counter is cleared to zero,
 * restarting the PWM cycle.  This allows external synchronisation of
 * the PWM period to other peripherals or pin events.
 * ---------------------------------------------------------------- */
#define PWM1ERS SFR8(0x0460)

/* Bits 7:5 - Reserved: read as 0, write as 0.                      */

/* Bits 4:0 - ERS[4:0]: External Reset Source Select
 *   Selects which signal can reset the PWM period counter.
 *   Refer to DS40002213D "PWM External Reset Sources" table for
 *   the complete mapping of source codes to signal names.           */
#define PWM1ERS_ERS4 4
#define PWM1ERS_ERS3 3
#define PWM1ERS_ERS2 2
#define PWM1ERS_ERS1 1
#define PWM1ERS_ERS0 0

#define PWM1ERS_ERS_MASK 0x1F /* bits 4:0 */
#define PWM1ERS_ERS_POS 0

/* -------------------------------------------------------------------
 * PWM1CLK - PWM1 Clock Source Select
 * Address: 0x0461
 *
 * Selects the input clock source for the PWM1 period counter.  The
 * selected clock is further divided by the prescaler (PWM1CPRE)
 * before clocking the 16-bit counter.
 * ---------------------------------------------------------------- */
#define PWM1CLK SFR8(0x0461)

/* Bits 7:5 - Reserved: read as 0, write as 0.                      */

/* Bits 4:0 - CLK[4:0]: Clock Source Select
 *   Selects the clock signal for the PWM period counter.
 *   Refer to DS40002213D "PWM Clock Sources" table for the
 *   complete mapping of source codes to signal names.               */
#define PWM1CLK_CLK4 4
#define PWM1CLK_CLK3 3
#define PWM1CLK_CLK2 2
#define PWM1CLK_CLK1 1
#define PWM1CLK_CLK0 0

#define PWM1CLK_CLK_MASK 0x1F /* bits 4:0 */
#define PWM1CLK_CLK_POS 0

/* -------------------------------------------------------------------
 * PWM1LDS - PWM1 Auto-Load Trigger Source Select
 * Address: 0x0462
 *
 * Selects the event that triggers the transfer of double-buffered
 * values (period, duty cycle) from the buffer registers into the
 * active registers.  The load occurs only when the LD (load-armed)
 * bit in PWMnCON is set; after the transfer, LD is automatically
 * cleared.
 * ---------------------------------------------------------------- */
#define PWM1LDS SFR8(0x0462)

/* Bits 7:5 - Reserved: read as 0, write as 0.                      */

/* Bits 4:0 - LDS[4:0]: Auto-Load Trigger Source Select
 *   Selects the event that causes buffered values to be loaded.
 *   Refer to DS40002213D "PWM Auto-Load Sources" table for the
 *   complete mapping of source codes to signal names.               */
#define PWM1LDS_LDS4 4
#define PWM1LDS_LDS3 3
#define PWM1LDS_LDS2 2
#define PWM1LDS_LDS1 1
#define PWM1LDS_LDS0 0

#define PWM1LDS_LDS_MASK 0x1F /* bits 4:0 */
#define PWM1LDS_LDS_POS 0

/* -------------------------------------------------------------------
 * PWM1PR - PWM1 Period Register (16-bit)
 * Address: 0x0463 (low byte), 0x0464 (high byte)
 *
 * Sets the PWM period.  The 16-bit counter counts from 0 up to the
 * value in PWM1PR, then resets to 0 on the next clock tick (period =
 * (PR + 1) * prescaled-clock-period in left/right-aligned modes; in
 * center-aligned mode the counter counts up to PR then back down,
 * giving period = 2 * PR * prescaled-clock-period).
 *
 * This register is double-buffered; writes go to the buffer and are
 * transferred to the active register on the next auto-load event.
 * ---------------------------------------------------------------- */
#define PWM1PR SFR16(0x0463)

/* -------------------------------------------------------------------
 * PWM1CPRE - PWM1 Clock Prescaler
 * Address: 0x0465
 *
 * Divides the selected input clock before it reaches the 16-bit
 * period counter.  The division ratio is (CPRE + 1), giving a range
 * of 1:1 (CPRE = 0x00) through 1:256 (CPRE = 0xFF).
 * ---------------------------------------------------------------- */
#define PWM1CPRE SFR8(0x0465)

/* Bits 7:0 - CPRE[7:0]: Prescaler Divider Value
 *   Clock division ratio = CPRE + 1.
 *   0x00 = 1:1 (no division)
 *   0x01 = 1:2
 *   ...
 *   0xFF = 1:256                                                    */
#define PWM1CPRE_CPRE_MASK 0xFF /* bits 7:0 */
#define PWM1CPRE_CPRE_POS 0

/* -------------------------------------------------------------------
 * PWM1PIPOS - PWM1 Period Interrupt Postscaler Offset
 * Address: 0x0466
 *
 * Specifies how many complete PWM periods elapse before the first
 * period interrupt is generated.  After the first interrupt fires,
 * subsequent period interrupts are generated at the postscaler rate
 * (set elsewhere).  This allows offsetting the interrupt timing
 * relative to the module enable, which is useful for staggering
 * interrupt servicing across multiple PWM channels.
 * ---------------------------------------------------------------- */
#define PWM1PIPOS SFR8(0x0466)

/* Bits 7:0 - PIPOS[7:0]: Postscaler Offset Count
 *   Number of PWM periods before the first period interrupt.
 *   0x00 = Interrupt on the first period completion.
 *   0x01 = Skip one period, interrupt on the second.
 *   ...
 *   0xFF = Skip 255 periods, interrupt on the 256th.                */
#define PWM1PIPOS_PIPOS_MASK 0xFF /* bits 7:0 */
#define PWM1PIPOS_PIPOS_POS 0

/* -------------------------------------------------------------------
 * PWM1GIR - PWM1 General Interrupt Request
 * Address: 0x0467
 *
 * Contains interrupt flags for Slice 1 parameter match events.
 * Each flag is set by hardware when the period counter matches the
 * corresponding parameter value.  Flags must be cleared in software
 * by writing 0 to the bit.
 * ---------------------------------------------------------------- */
#define PWM1GIR SFR8(0x0467)

/* Bits 7:2 - Reserved: read as 0, write as 0.                      */

/* Bit 1 - S1P2: Slice 1 Parameter 2 Interrupt Flag
 *   1 = Period counter matched PWM1S1P2 (P2 compare event occurred).
 *   0 = No P2 match event since last clear.
 *   Must be cleared in software.                                    */
#define PWM1GIR_S1P2 1

/* Bit 0 - S1P1: Slice 1 Parameter 1 Interrupt Flag
 *   1 = Period counter matched PWM1S1P1 (P1 compare event occurred).
 *   0 = No P1 match event since last clear.
 *   Must be cleared in software.                                    */
#define PWM1GIR_S1P1 0

/* -------------------------------------------------------------------
 * PWM1GIE - PWM1 General Interrupt Enable
 * Address: 0x0468
 *
 * Enables or disables the interrupt generation for Slice 1 parameter
 * match events.  When an enable bit is set and the corresponding
 * flag in PWM1GIR is set, an interrupt request is generated.
 * ---------------------------------------------------------------- */
#define PWM1GIE SFR8(0x0468)

/* Bits 7:2 - Reserved: read as 0, write as 0.                      */

/* Bit 1 - S1P2: Slice 1 Parameter 2 Interrupt Enable
 *   1 = Interrupt enabled on P2 match.
 *   0 = P2 match interrupt disabled.                                */
#define PWM1GIE_S1P2 1

/* Bit 0 - S1P1: Slice 1 Parameter 1 Interrupt Enable
 *   1 = Interrupt enabled on P1 match.
 *   0 = P1 match interrupt disabled.                                */
#define PWM1GIE_S1P1 0

/* -------------------------------------------------------------------
 * PWM1CON - PWM1 Control Register
 * Address: 0x0469
 *
 * Master control register for PWM1.  Enables the module, arms the
 * double-buffer load mechanism, selects push-pull operation, controls
 * external reset behaviour, and provides immediate reset capability.
 * ---------------------------------------------------------------- */
#define PWM1CON SFR8(0x0469)

/* Bit 7 - EN: PWM Module Enable
 *   1 = PWM1 is enabled; the period counter runs and outputs are
 *       driven according to the slice configuration.
 *   0 = PWM1 is disabled; counter is held in reset and outputs
 *       are inactive.                                               */
#define PWM1CON_EN 7

/* Bit 6 - LD: Load Armed (read-only status)
 *   1 = New buffered values are pending; they will be transferred
 *       to the active registers on the next auto-load trigger event.
 *   0 = No pending load; active registers hold current values.
 *   This bit is set by software writing new values and cleared
 *   automatically after the load transfer completes.                */
#define PWM1CON_LD 6

/* Bit 5 - Reserved: read as 0, write as 0.                         */

/* Bit 4 - PPEN: Push-Pull Enable
 *   1 = Push-pull mode enabled.  The two slice outputs (P1 and P2)
 *       alternate activity on successive PWM periods, producing a
 *       push-pull drive suitable for transformer-coupled converters.
 *   0 = Normal (non-push-pull) operation; both outputs are active
 *       on every period.                                            */
#define PWM1CON_PPEN 4

/* Bit 3 - Reserved: read as 0, write as 0.                         */

/* Bit 2 - ERSNOW: External Reset Now (write-only trigger)
 *   Writing 1 to this bit forces an immediate reset of the period
 *   counter to zero, regardless of the external reset source
 *   selection.  The bit auto-clears after the reset; reads return 0.
 *   Useful for software-initiated PWM resynchronisation.            */
#define PWM1CON_ERSNOW 2

