Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_pwm.h
/* Bit 1 - ERSPOL: External Reset Polarity
 *   1 = External reset is active on the rising (high) edge/level
 *       of the selected reset source.
 *   0 = External reset is active on the falling (low) edge/level
 *       of the selected reset source.                               */
#define PWM1CON_ERSPOL 1

/* Bit 0 - Reserved: read as 0, write as 0.                         */

/* -------------------------------------------------------------------
 * PWM1S1CFG - PWM1 Slice 1 Configuration
 * Address: 0x046A
 *
 * Configures the output polarity and alignment mode for Slice 1.
 * The alignment mode determines how the duty-cycle parameters (P1
 * and P2) relate to the period counter and where output transitions
 * occur within the PWM cycle.
 * ---------------------------------------------------------------- */
#define PWM1S1CFG SFR8(0x046A)

/* Bit 7 - POL2: Parameter 2 Output Polarity
 *   1 = P2 output is active-high (output high during duty portion).
 *   0 = P2 output is active-low (output low during duty portion).   */
#define PWM1S1CFG_POL2 7

/* Bit 6 - POL1: Parameter 1 Output Polarity
 *   1 = P1 output is active-high.
 *   0 = P1 output is active-low.                                   */
#define PWM1S1CFG_POL1 6

/* Bits 5:3 - Reserved: read as 0, write as 0.                      */

/* Bits 2:0 - MODE[2:0]: Output Alignment Mode
 *   000 = Left-aligned   : Standard edge-aligned PWM.  Output
 *           transitions at counter=0 (set) and counter=Px (clear).
 *   001 = Right-aligned  : Output transitions aligned to the end
 *           of the period (counter=PR).
 *   010 = Center-aligned : Symmetric PWM.  Counter counts up to PR
 *           then back down; output toggles on both up and down
 *           matches, producing centred pulses with reduced harmonics.
 *   011 = Variable left/right align : Programmable alignment mixing
 *           left and right edge placement.
 *   100 = Dual edge PWM  : Independent control of both rising and
 *           falling output edges using P1 and P2 respectively.
 *   101-111 = Reserved.                                             */
#define PWM1S1CFG_MODE2 2
#define PWM1S1CFG_MODE1 1
#define PWM1S1CFG_MODE0 0

#define PWM1S1CFG_MODE_MASK 0x07 /* bits 2:0 */
#define PWM1S1CFG_MODE_POS 0

/* Named mode values for PWMnS1CFG MODE[2:0]                        */
#define PWM_MODE_LEFT 0x00      /* Left-aligned (standard PWM)     */
#define PWM_MODE_RIGHT 0x01     /* Right-aligned                   */
#define PWM_MODE_CENTER 0x02    /* Center-aligned (symmetric)      */
#define PWM_MODE_VARIABLE 0x03  /* Variable left/right align       */
#define PWM_MODE_DUAL_EDGE 0x04 /* Dual edge PWM                   */

/* -------------------------------------------------------------------
 * PWM1S1P1 - PWM1 Slice 1 Parameter 1 (16-bit)
 * Address: 0x046B (low byte), 0x046C (high byte)
 *
 * Sets the duty cycle or compare value for output 1 of Slice 1.
 * The exact behaviour depends on the alignment mode:
 *   Left-aligned  : Output 1 is set at counter=0, cleared at P1.
 *   Right-aligned : Output 1 is cleared at counter=0, set at P1.
 *   Center-aligned: Output toggles when counter matches P1 in both
 *                   the up-counting and down-counting directions.
 *   Dual edge     : P1 defines the rising edge position.
 *
 * This register is double-buffered; writes go to the buffer and
 * transfer to the active register on the next auto-load event.
 * ---------------------------------------------------------------- */
#define PWM1S1P1 SFR16(0x046B)

/* -------------------------------------------------------------------
 * PWM1S1P2 - PWM1 Slice 1 Parameter 2 (16-bit)
 * Address: 0x046D (low byte), 0x046E (high byte)
 *
 * Sets the duty cycle or compare value for output 2 of Slice 1.
 * Operates identically to PWM1S1P1 but controls the second output.
 * In dual-edge mode, P2 defines the falling edge position.
 *
 * This register is double-buffered.
 * ---------------------------------------------------------------- */
#define PWM1S1P2 SFR16(0x046D)

/* =====================================================================
 *  PWM2 - 16-bit PWM Module 2
 *  Base address: 0x046F
 *
 *  Functionally identical to PWM1.  Bit definitions within each
 *  register are the same as the corresponding PWM1 register.
 * ================================================================== */

#define PWM2ERS SFR8(0x046F)
#define PWM2CLK SFR8(0x0470)
#define PWM2LDS SFR8(0x0471)
#define PWM2PR SFR16(0x0472)
#define PWM2CPRE SFR8(0x0474)
#define PWM2PIPOS SFR8(0x0475)
#define PWM2GIR SFR8(0x0476)
#define PWM2GIE SFR8(0x0477)
#define PWM2CON SFR8(0x0478)
#define PWM2S1CFG SFR8(0x0479)
#define PWM2S1P1 SFR16(0x047A)
#define PWM2S1P2 SFR16(0x047C)

/* Bit definitions for PWM2 registers - identical positions to PWM1  */

/* PWM2ERS bits                                                      */
#define PWM2ERS_ERS4 4
#define PWM2ERS_ERS3 3
#define PWM2ERS_ERS2 2
#define PWM2ERS_ERS1 1
#define PWM2ERS_ERS0 0
#define PWM2ERS_ERS_MASK 0x1F
#define PWM2ERS_ERS_POS 0

/* PWM2CLK bits                                                      */
#define PWM2CLK_CLK4 4
#define PWM2CLK_CLK3 3
#define PWM2CLK_CLK2 2
#define PWM2CLK_CLK1 1
#define PWM2CLK_CLK0 0
#define PWM2CLK_CLK_MASK 0x1F
#define PWM2CLK_CLK_POS 0

/* PWM2LDS bits                                                      */
#define PWM2LDS_LDS4 4
#define PWM2LDS_LDS3 3
#define PWM2LDS_LDS2 2
#define PWM2LDS_LDS1 1
#define PWM2LDS_LDS0 0
#define PWM2LDS_LDS_MASK 0x1F
#define PWM2LDS_LDS_POS 0

/* PWM2CPRE                                                          */
#define PWM2CPRE_CPRE_MASK 0xFF
#define PWM2CPRE_CPRE_POS 0

/* PWM2PIPOS                                                         */
#define PWM2PIPOS_PIPOS_MASK 0xFF
#define PWM2PIPOS_PIPOS_POS 0

/* PWM2GIR bits                                                      */
#define PWM2GIR_S1P2 1
#define PWM2GIR_S1P1 0

/* PWM2GIE bits                                                      */
#define PWM2GIE_S1P2 1
#define PWM2GIE_S1P1 0

