Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_pwm.h
/* PWM2CON bits                                                      */
#define PWM2CON_EN 7
#define PWM2CON_LD 6
#define PWM2CON_PPEN 4
#define PWM2CON_ERSNOW 2
#define PWM2CON_ERSPOL 1

/* PWM2S1CFG bits                                                    */
#define PWM2S1CFG_POL2 7
#define PWM2S1CFG_POL1 6
#define PWM2S1CFG_MODE2 2
#define PWM2S1CFG_MODE1 1
#define PWM2S1CFG_MODE0 0
#define PWM2S1CFG_MODE_MASK 0x07
#define PWM2S1CFG_MODE_POS 0

/* =====================================================================
 *  PWM3 - 16-bit PWM Module 3
 *  Base address: 0x047E
 *
 *  Functionally identical to PWM1.  Bit definitions within each
 *  register are the same as the corresponding PWM1 register.
 * ================================================================== */

#define PWM3ERS SFR8(0x047E)
#define PWM3CLK SFR8(0x047F)
#define PWM3LDS SFR8(0x0480)
#define PWM3PR SFR16(0x0481)
#define PWM3CPRE SFR8(0x0483)
#define PWM3PIPOS SFR8(0x0484)
#define PWM3GIR SFR8(0x0485)
#define PWM3GIE SFR8(0x0486)
#define PWM3CON SFR8(0x0487)
#define PWM3S1CFG SFR8(0x0488)
#define PWM3S1P1 SFR16(0x0489)
#define PWM3S1P2 SFR16(0x048B)

/* Bit definitions for PWM3 registers - identical positions to PWM1  */

/* PWM3ERS bits                                                      */
#define PWM3ERS_ERS4 4
#define PWM3ERS_ERS3 3
#define PWM3ERS_ERS2 2
#define PWM3ERS_ERS1 1
#define PWM3ERS_ERS0 0
#define PWM3ERS_ERS_MASK 0x1F
#define PWM3ERS_ERS_POS 0

/* PWM3CLK bits                                                      */
#define PWM3CLK_CLK4 4
#define PWM3CLK_CLK3 3
#define PWM3CLK_CLK2 2
#define PWM3CLK_CLK1 1
#define PWM3CLK_CLK0 0
#define PWM3CLK_CLK_MASK 0x1F
#define PWM3CLK_CLK_POS 0

/* PWM3LDS bits                                                      */
#define PWM3LDS_LDS4 4
#define PWM3LDS_LDS3 3
#define PWM3LDS_LDS2 2
#define PWM3LDS_LDS1 1
#define PWM3LDS_LDS0 0
#define PWM3LDS_LDS_MASK 0x1F
#define PWM3LDS_LDS_POS 0

/* PWM3CPRE                                                          */
#define PWM3CPRE_CPRE_MASK 0xFF
#define PWM3CPRE_CPRE_POS 0

/* PWM3PIPOS                                                         */
#define PWM3PIPOS_PIPOS_MASK 0xFF
#define PWM3PIPOS_PIPOS_POS 0

/* PWM3GIR bits                                                      */
#define PWM3GIR_S1P2 1
#define PWM3GIR_S1P1 0

/* PWM3GIE bits                                                      */
#define PWM3GIE_S1P2 1
#define PWM3GIE_S1P1 0

/* PWM3CON bits                                                      */
#define PWM3CON_EN 7
#define PWM3CON_LD 6
#define PWM3CON_PPEN 4
#define PWM3CON_ERSNOW 2
#define PWM3CON_ERSPOL 1

/* PWM3S1CFG bits                                                    */
#define PWM3S1CFG_POL2 7
#define PWM3S1CFG_POL1 6
#define PWM3S1CFG_MODE2 2
#define PWM3S1CFG_MODE1 1
#define PWM3S1CFG_MODE0 0
#define PWM3S1CFG_MODE_MASK 0x07
#define PWM3S1CFG_MODE_POS 0

/* =====================================================================
 *  PWM4 - 16-bit PWM Module 4
 *  Base address: 0x048D
 *
 *  Functionally identical to PWM1.  Bit definitions within each
 *  register are the same as the corresponding PWM1 register.
 * ================================================================== */

#define PWM4ERS SFR8(0x048D)
#define PWM4CLK SFR8(0x048E)
#define PWM4LDS SFR8(0x048F)
#define PWM4PR SFR16(0x0490)
#define PWM4CPRE SFR8(0x0492)
#define PWM4PIPOS SFR8(0x0493)
#define PWM4GIR SFR8(0x0494)
#define PWM4GIE SFR8(0x0495)
#define PWM4CON SFR8(0x0496)
#define PWM4S1CFG SFR8(0x0497)
#define PWM4S1P1 SFR16(0x0498)
#define PWM4S1P2 SFR16(0x049A)

/* Bit definitions for PWM4 registers - identical positions to PWM1  */

/* PWM4ERS bits                                                      */
#define PWM4ERS_ERS4 4
#define PWM4ERS_ERS3 3
#define PWM4ERS_ERS2 2
#define PWM4ERS_ERS1 1
#define PWM4ERS_ERS0 0
#define PWM4ERS_ERS_MASK 0x1F
#define PWM4ERS_ERS_POS 0

/* PWM4CLK bits                                                      */
#define PWM4CLK_CLK4 4
#define PWM4CLK_CLK3 3
#define PWM4CLK_CLK2 2
#define PWM4CLK_CLK1 1
#define PWM4CLK_CLK0 0
#define PWM4CLK_CLK_MASK 0x1F
#define PWM4CLK_CLK_POS 0

/* PWM4LDS bits                                                      */
#define PWM4LDS_LDS4 4
#define PWM4LDS_LDS3 3
#define PWM4LDS_LDS2 2
#define PWM4LDS_LDS1 1
#define PWM4LDS_LDS0 0
#define PWM4LDS_LDS_MASK 0x1F
#define PWM4LDS_LDS_POS 0

/* PWM4CPRE                                                          */
#define PWM4CPRE_CPRE_MASK 0xFF
#define PWM4CPRE_CPRE_POS 0

/* PWM4PIPOS                                                         */
#define PWM4PIPOS_PIPOS_MASK 0xFF
#define PWM4PIPOS_PIPOS_POS 0

/* PWM4GIR bits                                                      */
#define PWM4GIR_S1P2 1
#define PWM4GIR_S1P1 0

/* PWM4GIE bits                                                      */
#define PWM4GIE_S1P2 1
#define PWM4GIE_S1P1 0

/* PWM4CON bits                                                      */
#define PWM4CON_EN 7
#define PWM4CON_LD 6
#define PWM4CON_PPEN 4
#define PWM4CON_ERSNOW 2
#define PWM4CON_ERSPOL 1

/* PWM4S1CFG bits                                                    */
#define PWM4S1CFG_POL2 7
#define PWM4S1CFG_POL1 6
#define PWM4S1CFG_MODE2 2
#define PWM4S1CFG_MODE1 1
#define PWM4S1CFG_MODE0 0
#define PWM4S1CFG_MODE_MASK 0x07
#define PWM4S1CFG_MODE_POS 0

/* =====================================================================
 *  Global PWM Control Registers
 *
 *  These registers provide simultaneous control over the load-armed
 *  and enable states of all four PWM modules.  By writing to PWMLOAD
 *  or PWMEN, software can synchronise multiple PWM channels to start,
 *  stop, or load new values at the same time without the latency of
 *  accessing each module's control register individually.
 * ================================================================== */

/* -------------------------------------------------------------------
 * PWMLOAD - PWM Load Control Register
 * Address: 0x049C
 *
 * Each bit arms the double-buffer load for the corresponding PWM
 * module.  Setting a bit is equivalent to setting the LD bit in
 * the individual module's CON register; new buffered values will
 * transfer to the active registers on the next auto-load event.
 * ---------------------------------------------------------------- */
#define PWMLOAD SFR8(0x049C)

/* Bits 7:4 - Reserved: read as 0, write as 0.                      */

/* Bit 3 - MPWM4LD: PWM4 Load Armed
 *   1 = Arm PWM4 buffer load; buffered values will transfer on the
 *       next PWM4 auto-load trigger event.
 *   0 = PWM4 load not armed.                                       */
#define PWMLOAD_MPWM4LD 3

/* Bit 2 - MPWM3LD: PWM3 Load Armed
 *   1 = Arm PWM3 buffer load.
 *   0 = PWM3 load not armed.                                       */
#define PWMLOAD_MPWM3LD 2

