Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_pwm.h
/* Bit 1 - MPWM2LD: PWM2 Load Armed
 *   1 = Arm PWM2 buffer load.
 *   0 = PWM2 load not armed.                                       */
#define PWMLOAD_MPWM2LD 1

/* Bit 0 - MPWM1LD: PWM1 Load Armed
 *   1 = Arm PWM1 buffer load.
 *   0 = PWM1 load not armed.                                       */
#define PWMLOAD_MPWM1LD 0

/* -------------------------------------------------------------------
 * PWMEN - PWM Enable Register
 * Address: 0x049D
 *
 * Each bit enables or disables the corresponding PWM module.
 * Setting a bit is equivalent to setting the EN bit in the
 * individual module's CON register.  Writing multiple bits
 * simultaneously allows atomic start/stop of multiple channels.
 * ---------------------------------------------------------------- */
#define PWMEN SFR8(0x049D)

/* Bits 7:4 - Reserved: read as 0, write as 0.                      */

/* Bit 3 - MPWM4EN: PWM4 Enable
 *   1 = PWM4 enabled; period counter runs, outputs active.
 *   0 = PWM4 disabled; counter held in reset, outputs inactive.     */
#define PWMEN_MPWM4EN 3

/* Bit 2 - MPWM3EN: PWM3 Enable
 *   1 = PWM3 enabled.
 *   0 = PWM3 disabled.                                              */
#define PWMEN_MPWM3EN 2

/* Bit 1 - MPWM2EN: PWM2 Enable
 *   1 = PWM2 enabled.
 *   0 = PWM2 disabled.                                              */
#define PWMEN_MPWM2EN 1

/* Bit 0 - MPWM1EN: PWM1 Enable
 *   1 = PWM1 enabled.
 *   0 = PWM1 disabled.                                              */
#define PWMEN_MPWM1EN 0

#endif /* PIC18F_Q84_PWM_H */
